notes/tutorial/11-16-Tail-recursion-in-Clojure.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-16 Mon 12:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tail recursion in Clojure</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mark Armstrong" />
<meta name="description" content="Visualising stack frames in recursive definitions in Clojure
in order to understand how tail recursion saves memory."
 />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Tail recursion in Clojure</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#Introduction">1. Introduction</a></li>
<li><a href="#Motivation">2. Motivation</a></li>
<li><a href="#Recursion-and-the-stack">3. Recursion and the stack</a></li>
<li><a href="#Tail-recursion">4. Tail recursion</a></li>
<li><a href="#Visualising-the-stack">5. Visualising the stack</a></li>
<li><a href="#A-factorial-function-that-shows-its-stack-usage">6. A factorial function that shows its stack usage</a></li>
<li><a href="#A-tail-recursive-factorial-function-that-shows-its-stack-usage">7. A tail-recursive factorial function that shows its stack usage</a></li>
<li><a href="#A-macro-to-automate-showing-stack-usage">8. A macro to automate showing stack usage</a></li>
</ul>
</div>
</div>

<div id="outline-container-Introduction" class="outline-2">
<h2 id="Introduction"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-Introduction">
<p>
These notes were created during the tutorials on November 16th and 18th.
</p>
</div>
</div>

<div id="outline-container-Motivation" class="outline-2">
<h2 id="Motivation"><span class="section-number-2">2</span> Motivation</h2>
<div class="outline-text-2" id="text-Motivation">
<p>
In general, recursion as a control structure is <i>less efficient</i> than
iterating (or looping) constructs, because each recursive call
requires an additional <i>stack frame</i>, used to store the parameters
and any local memory for the call.
</p>

<p>
This is why “uncontrolled recursion” usually results in a <i>stack overflow</i>,
that is, running out of memory on the stack,
whereas an “infinite loop” may continue to run indefinitely,
never causing memory issues.
</p>

<p>
However, while these additional stack frames
are necessary <i>in general</i> for recursion,
there is a special case in which the stack frame can be <i>reused</i>,
avoiding this issue. This kind of recursion is known
as <i>tail recursion</i>, and our goal today is to visualise how it works,
as well as come to understand how to write tail recursive functions.
</p>

<p>
We will use Clojure for this exercise,
both because it is a functional language and hence recursion
is a very natural control structure to use in it,
and because its powerful <i>macro</i> system will allow us
to provide you with a new way to define functions
which “automatically” output a visualisation of
their use of the stack.
</p>
</div>
</div>

<div id="outline-container-Recursion-and-the-stack" class="outline-2">
<h2 id="Recursion-and-the-stack"><span class="section-number-2">3</span> Recursion and the stack</h2>
<div class="outline-text-2" id="text-Recursion-and-the-stack">
</div>
</div>
<div id="outline-container-Tail-recursion" class="outline-2">
<h2 id="Tail-recursion"><span class="section-number-2">4</span> Tail recursion</h2>
<div class="outline-text-2" id="text-Tail-recursion">
</div>
</div>
<div id="outline-container-Visualising-the-stack" class="outline-2">
<h2 id="Visualising-the-stack"><span class="section-number-2">5</span> Visualising the stack</h2>
<div class="outline-text-2" id="text-Visualising-the-stack">
</div>
</div>
<div id="outline-container-A-factorial-function-that-shows-its-stack-usage" class="outline-2">
<h2 id="A-factorial-function-that-shows-its-stack-usage"><span class="section-number-2">6</span> A factorial function that shows its stack usage</h2>
<div class="outline-text-2" id="text-A-factorial-function-that-shows-its-stack-usage">
</div>
</div>
<div id="outline-container-A-tail-recursive-factorial-function-that-shows-its-stack-usage" class="outline-2">
<h2 id="A-tail-recursive-factorial-function-that-shows-its-stack-usage"><span class="section-number-2">7</span> A tail-recursive factorial function that shows its stack usage</h2>
<div class="outline-text-2" id="text-A-tail-recursive-factorial-function-that-shows-its-stack-usage">
</div>
</div>
<div id="outline-container-A-macro-to-automate-showing-stack-usage" class="outline-2">
<h2 id="A-macro-to-automate-showing-stack-usage"><span class="section-number-2">8</span> A macro to automate showing stack usage</h2>
<div class="outline-text-2" id="text-A-macro-to-automate-showing-stack-usage">
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mark Armstrong</p>
     <p class="author">Contact: <a href="mailto:markparmstrong@gmail.com">markparmstrong@gmail.com</a></p>
     <p class="date">Original date: </p>
     <p class="date">Last updated: 2020-11-16 Mon 12:26</p>
     <p class="creator">Created using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.0.91 (<a href="https://orgmode.org">Org</a> mode 9.4)</p>
     <p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
